
"""
Bug არის პროგრამულ უზრუნველყოფაში
არსებული შეცდომა ან ხარვეზი, რომელიც იწვევს პროგრამის 
არასწორად მუშაობას ან საერთოდ არ იმუშავებას. ბაგები შეიძლება 
წარმოიშვას კოდის არასწორად დაწერის, არასწორი ლოგიკის, ხარვეზიანი
ტესტირების ან სხვა ტექნიკური მიზეზების შედეგად.
Debugging კი არის პროცესი, რომლის მეშვეობითაც 
პროგრამისტები ცდილობენ იპოვონ და გამოასწორონ ეს ბაგები. დებაგინგისას
პროგრამისტები ახორციელებენ კოდის დეტალურ ანალიზს, იყენებენ 
სხვადასხვა ხელსაწყოებს და მეთოდებს, რათა გაიგონ,
სად არის შეცდომა და როგორ შეიძლება მისი გამოსწორება.
როგორც წესი, debugging არის ერთ-ერთი მნიშვნელოვანი
და განუყოფელი ნაწილი პროგრამის განვითარების პროცესში,
რადგან ის ხელს უწყობს პროგრამის ხარისხისა და სანდოობის გაუმჯობესებას.
"""



#he loo = 12

#print (loo)
#სინტაქსური შეცდომა


ages = [30,33]
print (ages[0]+ages[1])

 






father_age= int(input ("enter you age:") )
print(father_age + 5)
























